src/InformationRegisters/дсфВерсииРеестровОтгрузкиЯндексМаркет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>дсфВерсииРеестровОтгрузкиЯндексМаркет</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТипРеестра</Name>
					<Type>
						<v8:Type>cfg:EnumRef.дсфТипыРеестровЯндексМаркет</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипРеестраКод</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРеестра</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДанныеРеестра</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЗаявкаНаОтгрузку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.дсфЗаявкаНаОтгрузку</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторРеестра</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/дсфВерсииРеестровОтгрузкиЯндексМаркет/Ext/ManagerModule.bsl
// Процедура добавляет запись в регистр по переданным значениям структуры.
Процедура ДобавитьЗапись(СтруктураЗаписи, Загрузка = Ложь) Экспорт
	Если СтруктураЗаписи.Свойство("ДатаИзменения") = Ложь Тогда
		СтруктураЗаписи.Вставить("ДатаИзменения", ТекущаяДатаСеанса());
		
	КонецЕсли;
	
	дсфОбменДаннымиСлужебный.ДобавитьЗаписьВРегистрСведений(СтруктураЗаписи, "дсфВерсииРеестровОтгрузкиЯндексМаркет", Загрузка);
	
КонецПроцедуры

// Процедура удаляет набор записей в регистре по переданным значениям структуры.
Процедура УдалитьЗапись(СтруктураЗаписи, Загрузка = Ложь) Экспорт
	
	дсфОбменДаннымиСлужебный.УдалитьНаборЗаписейВРегистреСведений(СтруктураЗаписи,
																	"дсфВерсииРеестровОтгрузкиЯндексМаркет",
																	Загрузка);
	
КонецПроцедуры

// Процедура обновляет набор записей в регистре по переданным значениям структуры.
Процедура ОбновитьЗапись(СтруктураЗаписи) Экспорт
	
	Если СтруктураЗаписи.Свойство("ДатаИзменения") = Ложь Тогда
		СтруктураЗаписи.Вставить("ДатаИзменения", ТекущаяДатаСеанса());
		
	КонецЕсли;

	дсфОбменДаннымиСлужебный.ОбновитьЗаписьВРегистреСведений(СтруктураЗаписи, "дсфВерсииРеестровОтгрузкиЯндексМаркет");
	
КонецПроцедуры

// Возвращает признак наличия записи в регистре по переданному отбору.
//
// Параметры:
//   ЗаявкаНаПриемку - ДокументСсылка - ЗаявкаНаПриемку
//   ИдентификаторРеестра - Строка - Внешний идентификатор реестра (yandexId):
//
// Возвращаемое значение:
//   Булево - Истина, если в регистре содержатся записи для заданного отбора.
//
Функция ЗаписьЕстьВРегистре(ЗаявкаНаОтгрузку, ИдентификаторРеестра) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА КАК ЕстьЗапись
	|ИЗ
	|	РегистрСведений.дсфВерсииРеестровОтгрузкиЯндексМаркет КАК ВерсииРеестровОтгрузкиЯндексМаркет
	|ГДЕ
	|	ВерсииРеестровОтгрузкиЯндексМаркет.ЗаявкаНаОтгрузку = &ЗаявкаНаОтгрузку
	|	И ВерсииРеестровОтгрузкиЯндексМаркет.ИдентификаторРеестра = &ИдентификаторРеестра");

	Запрос.УстановитьПараметр("ЗаявкаНаОтгрузку", ЗаявкаНаОтгрузку);
	Запрос.УстановитьПараметр("ИдентификаторРеестра", ИдентификаторРеестра);

	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции
